[
  {
    "title": "¿Qué es la Estadística?",
    "content": "<img src='public/img/estadistica.jpg' alt='Imagen de Estadística'><p>La <strong>estadística</strong> suele ser definida como la ciencia de aprender de los <strong>datos</strong> o como la ciencia de obtener conclusiones en la presencia de incertidumbre.</p><p>Se relaciona principalmente con la recolección, análisis e interpretación de datos, así como también con la efectiva comunicación y presentación de los resultados basados en esos datos. Como por datos entendemos a cualquier clase de información grabada, la estadística juego un rol importante en muchas disciplinas científicas.</p><p>La estadística puede ser muy importante para una efectiva toma de decisiones. Existe una gran cantidad de valiosa información escondida entre los datos</p><p>La Estadística nos brinda los principios fundamentales que nos permiten extraer y entender esa información; tambien nos proporciona las herramientas necesarias para verificar la calidad de nuestros datos y nuestra información</p>",
    "date": "2024-04-01",
    "tags": ["estadística", "datos"]
  },
  {
    "title": "¿Qué es la Probabilidad?",
    "content": "<img src='public/img/probabilidad.jpg' alt='Imagen de probailidad'><p>La <strong>probabilidad</strong> mide la mayor o menor posibilidad de que se dé un determinado resultado (suceso o evento) cuando se realiza un experimento aleatorio.</p><p> Para calcular la probabilidad de un evento se toma en cuenta todos los casos posibles de ocurrencia del mismo; es decir, de cuántas formas puede ocurrir determinada situación. Los casos favorables de ocurrencia de un evento serán los que cumplan con la condición que estamos buscando. La probabilidad toma valores entre 0 y 1 (o expresados en tanto por ciento, entre 0% y 100%).</p> <p>La probabilidad también funciona como complemento de la <strong>estadística</strong> cuando nos proporciona una sólida base para la estadistica inferencial. Cuando hay incertidumbre, no sabemos que puede pasar y hay alguna posibilidad de errores, utilizando probabilidades podemos aprender formas de controlar la tasa de errores para reducirlos.</p> ",
    "date": "2024-04-02",
    "tags": ["estadística", "probabilidad"]
  },
  {
    "title": "El Análisis Estadístico",
    "content": "<img src='public/img/analisis.jpg' alt='Imagen de Analisis'><p>Las técnicas estadísticas deberían ser vistas como una parte importante de cualquier proceso de toma de dicisiones, permitiendo tomar decisiones estratégicamente informadas que combinen intuición con experiencia y un entendimiento estadístico de los datos que tenemos disponibles.</p> <p>Un análisis estadístico suele contener 5 actividades básicas:</p> <ol> <li><strong>Diseño del análisis</strong>: Esta actividad involucra el planeamiento de los detalles para obtener los datos que necesitamos y la generación de la hipótesis a ser evaluada.</li> <li><strong>Exploración de datos</strong>: En esta actividad nos dedicamos a jugar con nuestros datos, los describimos, los resumimos, realizamos gráficos para mirarlos desde distintos ángulos. Esta exploración nos ayuda a asegurarnos que los datos que obtuvimos son completos y que la etapa de diseño fue correcta.</li><li><strong>Armado del modelo</strong>: En esta actividad intentamos armar un modelo que explique el comportamiento de nuestros datos y pueda llegar a hacer predicciones sobre los mismos. La idea es que el modelo pueda describir las propiedades fundamentales de nuestros datos.</li><li><strong>Realizar estimaciones</strong>: Aquí vamos a intentar realizar estimaciones basadas en el modelo que armamos anteriormente. También vamos a intentar estimar el tamaño del error que nuestro modelo puede tener en sus predicciones.</li><li><strong>Contraste de la hipótesis</strong>: Esta actividad es la que va a producir la decisión final sobre si las predicciones del modelo son correctas y ayudarnos a concluir si los datos que poseemos confirman o rechazan la hipótesis que generamos en la actividad 1.</li></ol>",
    "date": "2024-04-03",
    "tags": ["análisis", "estadística"]
  },
  {
    "title": "Estadística Descriptiva",
	"content": "<img src='public/img/descriptiva.jpg' alt='Imagen de Descriptiva'><p>En <strong>estadística descriptiva</strong> se utilizan distintas medidas para intentar describir las propiedades de nuestros datos, algunos de los conceptos básicos, son:</p><ul><li><strong>Media aritmética</strong>: La media aritmética es el valor obtenido al sumar todos los datos y dividir el resultado entre el número total elementos.</li><li><strong>Desviación respecto a la media</strong>: La desviación respecto a la media es la diferencia en valor absoluto entre cada valor de la variable estadística y la media aritmética</li><li><strong>Varianza</strong>: La varianza es la media aritmética del cuadrado de las desviaciones respecto a la media de una distribución estadística. La varianza intenta describir la dispersión de los datos.</li><li><strong>Desviación típica</strong>: La desviación típica es la raíz cuadrada de la varianza</li><li><strong>Moda</strong>: La moda es el valor que tiene mayor frecuencia absoluta.</li><li><strong>Mediana</strong>: La mediana es el valor que <strong>ocupa el lugar central</strong> de todos los datos cuando éstos están ordenados de menor a mayor</li><li><strong>Correlación</strong>: La correlación trata de establecer <strong>la relación o dependencia que existe entre las dos variables que intervienen en una distribución bidimensional</strong>. Es decir, determinar si los cambios en una de las variables influyen en los cambios de la otra. En caso de que suceda, diremos que las variables están correlacionadas o que hay correlación entre ellas. La correlación es positiva cuando los valores de las variables aumenta juntos; y es negativa cuando un valor de una variable se reduce cuando el valor de la otra variable aumenta.</li><li><strong>Covarianza</strong>: La covarianza es el equivalente de la varianza aplicado a una variable bidimensional. Es la media aritmética de los productos de las desviaciones de cada una de las variables respecto a sus medias respectivas.La covarianza indica el sentido de la correlación entre las variables.</li><li><strong>Valor atípico</strong>: Un valor atípico es una observación que se aleja demasiado de la moda; esta muy lejos de la tendencia principal del resto de los datos. Pueden ser causados por errores en la recolección de datos o medidas inusuales. Generalmente se recomienda eliminarlos del conjunto de datos.</li>",
	"date": "2024-04-05",
    "tags": ["descriptiva", "estadística"]
  },
  {
    "title": "Estadística Bayesiana",
	"content": "<img src='public/img/bayesian.jpg' alt='Imagen de bayesian'><p>La estadística bayesiana es un subconjunto del campo de la estadística en la que la evidencia sobre el verdadero estado de las cosas se expresa en términos de grados de creencia. Esta filosofía de tratar a las creencias como probabilidad es algo natural para los seres humanos. Nosotros la utilizamos constantemente a medida que interactuamos con el mundo y sólo vemos verdades parciales, necesitando reunir pruebas para formar nuestras creencias.</p><p>La diferencia fundamental entre la estadística clásica y la bayesiana es el concepto de probabilidad. Para la estadística clásica es un concepto objetivo, que se encuentra en la naturaleza, mientras que para la estadística bayesiana se encuentra en el observador, siendo así un concepto subjetivo. De este modo, en estadística clásica solo se toma como fuente de información las muestras obtenidas. En el caso bayesiano, sin embargo, además de la muestra también juega un papel fundamental la información previa o externa que se posee en relación a los fenómenos que se tratan de modelar.</p><p>La estadística bayesiana está demostrando su utilidad en ciertas estimaciones basadas en el conocimiento subjetivo a priori y el hecho de permitir revisar esas estimaciones en función de la evidencia empírica es lo que está abriendo nuevas formas de hacer conocimiento. Una aplicación de esto son los clasificadores bayesianos que son frecuentemente usados en implementaciones de filtros de correo basura, que se adaptan con el uso. La estadística bayesiana es un tema muy interesante que merece un artículo en sí mismo.</p>",
	"date": "2024-04-06",
    "tags": ["estadística", "análisis", "datos", "histograma"]
  },
  {
    "title": "Librerías de Python para Probabilidad y Estadística",
	"content": "<img src='public/img/codigo-python.jpg' alt='Imagen de codigo'><p>Python se lleva muy bien con las matemáticas. Además, la comunidad python es tan amplia que solemos encontrar una librería para cualquier problema al que nos enfrentemos. En este caso, los principales módulos que Python nos ofrece para trabajar con probabilidad y estadística, son:</p><ul><li><strong>numpy</strong>: El popular paquete matemático de Python, se utiliza tanto que mucha gente ya lo considera parte integral del lenguaje. Nos proporciona algunas funciones estadísticas que podemos aplicar fácilmente sobre los arrays de Numpy.</li><li><strong>scipy.stats</strong>: Este submodulo del paquete científico <strong>Scipy</strong> es el complemento perfecto para Numpy, las funciones estadisticas que no encontremos en uno, las podemos encontrar en el otro.</li><li><strong>statsmodels</strong>: Esta librería nos brinda un gran número de herramientas para explorar datos, estimar modelos estadísticos, realizar pruebas estadísticas y muchas cosas más.</li><li><strong>matplotlib</strong>: Es la librería más popular en Python para visualizaciones y gráficos. Ella nos va a permitir realizar los gráficos de las distintas distribuciones de datos.</li><li><strong>seaborn</strong>: Esta librería es un complemento ideal de matplotlib para realizar gráficos estadísticos.</li><li><strong>pandas</strong>: Esta es la librería más popular para análisis de datos y financieros. Posee algunas funciones muy útiles para realizar estadística descriptiva sobre nuestros datos y nos facilita sobremanera el trabajar con series de tiempo</li><li><strong>pyMC</strong>: pyMC es un módulo de Python que implementa modelos estadísticos bayesianos, incluyendo la cadena de Markov Monte Carlo. pyMC ofrece funcionalidades para hacer el análisis bayesiano lo mas simple posible.</li>",
	"date": "2024-04-07",
    "tags": ["python", "estadística", "análisis", "datos"]
  },
  {
    "title": "Ejemplos de estadística descriptiva con Python",
	"content": "<img src='public/img/data-python.jpg' alt='Imagen de data'><p>Calcular los principales indicadores de la estadística descriptiva con Python es muy fácil!.</p><br><pre><code>import numpy as np # importando numpy</code><br><code>from scipy import stats # importando scipy.stats</code><br><code>import pandas as pd # importando pandas</code><br><code>np.random.seed(2131982) # para poder replicar el random </code></pre><br><pre><code>datos = np.random.randn(5, 4) # datos normalmente distribuidos datos</code></pre><br><p><strong>Media Aritmetica</strong></p><pre><code>datos.mean() # Calcula la media aritmetica</code></pre><br><p><strong>Mediana</strong></p><pre><code>np.median(datos)</code></pre><br><p><strong>Desviación Típica</strong></p><pre><code>np.std(datos)</code></pre><br><p><strong>Varianza</strong></p><pre><code>np.var(datos)</code></pre><br><p><strong>Moda</strong></p><pre><code>stats.mode(datos)</code></pre><br><p><strong>Correlación</strong></p><pre><code>np.corrcoef(datos) #Crea matriz de Correlación</code></pre><br><p><strong>Correlación entre dos vectores</strong></p><pre><code>np.corrcoef(datos[0], datos[1]) </code></pre><br><p><strong>Covarianza</strong></p><pre><code>np.cov(datos) # Calcula la matriz de covarianza</code></pre><br><p><strong>Covarianza de dos Vectores</strong></p><pre><code>np.cov(datos[0], datos[1])</code></pre>",
	"date": "2024-04-08",
    "tags": ["python", "estadística", "descriptiva", "análisis", "datos"]
  },
  {
    "title": "Histogramas y Distribuciones en Python",
	"content": "<img src='public/img/histograma-python.jpg' alt='Imagen de histograma'><p>Muchas veces los indicadores de la estadística descriptiva no nos proporcionan una imagen clara de nuestros datos. Por esta razón, siempre es útil complementarlos con gráficos de las distribuciones de los datos, que describan con qué frecuencia aparece cada valor.La representación más común de una distribución es un histograma, que es un gráfico que muestra la frecuencia o probabilidad de cada valor.</p><p>El histograma muestra las frecuencias como un gráfico de barras que indica cuan frecuente un determinado valor ocurre en el conjunto de datos. El eje horizontal representa los valores del conjunto de datos y el eje vertical representa la frecuencia con que esos valores ocurren.</p><p>Las distribuciones se pueden clasificar en dos grandes grupos:</p><p>Las <strong>distribuciones continuas</strong>, que son aquellas que presentan un número infinito de posibles soluciones. Dentro de este grupo vamos a encontrar a las distribuciones:</p><ul><li>normal</li><li>gamma</li><li>chi cuadrado</li><li>t de Student</li><li>pareto</li></ul><p>Las <strong>distribuciones discretas</strong>, que son aquellas en las que la variable puede tomar un número determinado de valores. Los principales exponentes de este grupo son las distribuciones:</p><ul><li>poisson</li><li>binomial</li><li>hipergeométrica</li><li>bernoulli</li><p>Veamos algunos ejemplos graficados con la ayuda de Python</p><br><p><strong>Distribucion Normal</strong>la distribución normal es una de las principales distribuciones, ya que es la que con más frecuencia aparece aproximada en los fenómenos reales. Tiene una forma acampanada y es simétrica respecto de un determinado parámetro estadístico. Con la ayuda de Python la podemos graficar de la siguiente manera:</p><br><p><strong>Histograma de distribución normal</strong></p><pre><code>cuenta, cajas, ignorar = plt.hist(s, 30, normed=True)</code><br><code>normal = plt.plot(cajas, 1/(sigma * np.sqrt(2 * np.pi)) *</code><br><code> np.exp( - (cajas - mu)**2 / (2 * sigma**2) ), linewidth=2, color='r')</code></pre>",
	"date": "2024-04-09",
    "tags": ["python", "estadística", "análisis", "datos", "histograma"]
  }    
]
